eisup_2019_docmng_integration/src/Tasks/абсЗадачаДоговора/абсЗадачаДоговора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>абсЗадачаДоговора</name>
  <addressing>InformationRegister.РолиИИсполнители</addressing>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектЗадачи</name>
    <type>
      <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
      <types>DocumentRef.абс_ЗадачаВТехподдержку</types>
      <types>CatalogRef.НоменклатурныеГруппы</types>
      <types>DocumentRef.ТребованиеНакладная</types>
      <types>CatalogRef.ПрочиеДоходыИРасходы</types>
      <types>DocumentRef.абс_РезервыПроизведенныхРасходов</types>
      <types>CatalogRef.ОсновныеСредства</types>
      <types>DocumentRef.ДоговорНаВыполнениеРаботСФизЛицом</types>
      <types>DocumentRef.ПередачаТоваров</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.абс_ЗакупочныйЗаказ</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.абс_РеклассификацияБюджета</types>
      <types>CatalogRef.Контрагенты</types>
      <types>DocumentRef.абс_ЗаявкаНаДобавлениеИзменениеПрав</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.абс_ГрупповаяРеклассификацияБюджета</types>
      <types>DocumentRef.абс_СчетНаОплату</types>
      <types>DocumentRef.абс_ЗаявкаНаИзменениеРеквизитовКонтрагента</types>
      <types>DocumentRef.Абс_АктПриёмкиВыполненныхРабот</types>
      <types>CatalogRef.Номенклатура</types>
      <types>DocumentRef.КомплектацияНоменклатуры</types>
      <types>DocumentRef.абс_ВводБюджета</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>CatalogRef.СтатьиЗатрат</types>
      <types>DocumentRef.ПолучениеУслугПоПереработке</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗадачи</name>
    <type>
      <types>CatalogRef.ВидыЗадачПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторБП</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УведомлениеОтправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <addressingAttributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </addressingAttributes>
</mdclass:Task>

eisup_2019_docmng_integration/src/Catalogs/ВидыЗадачПользователей/ВидыЗадачПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыЗадачПользователей</name>
  <predefined>
    <items>
      <name>абс_ВводБюджета</name>
      <description>Абс ввод бюджета</description>
    </items>
    <items>
      <name>абс_АктПриёмкиВыполненныхРабот</name>
      <description>Акт приёмки выполненных работ</description>
    </items>
    <items>
      <name>ВозвратНаРаботу</name>
      <description>Возврат на работу</description>
    </items>
    <items>
      <name>ДеньРождения</name>
      <description>День рождения</description>
    </items>
    <items>
      <name>абс_ДоговорПодряда</name>
      <description>Договор подряда</description>
    </items>
    <items>
      <name>Доначисление</name>
      <description>Доначисление</description>
    </items>
    <items>
      <name>абс_ЗаявкаВПоддержку</name>
      <description>Заявка в поддержку</description>
    </items>
    <items>
      <name>КадровоеПеремещение</name>
      <description>Кадровое перемещение</description>
    </items>
    <items>
      <name>НачислениеПоКадровомуДокументу</name>
      <description>Начисление по кадровому документу</description>
    </items>
    <items>
      <name>ОтражениеЗарплатыВУчете</name>
      <description>Отражение зарплаты в учете</description>
    </items>
    <items>
      <name>ОценкаИспытательногоСрока</name>
      <description>Оценка испытательного срока</description>
    </items>
    <items>
      <name>ОшибкиПриемаПоОсновномуМестуРаботы</name>
      <description>Ошибки приема по основному месту работы</description>
    </items>
    <items>
      <name>ОшибкиПриемаПоСовместительству</name>
      <description>Ошибки приема по совместительству</description>
    </items>
    <items>
      <name>Перезаполнение</name>
      <description>Перезаполнение</description>
    </items>
    <items>
      <name>Перерасчет</name>
      <description>Перерасчет</description>
    </items>
    <items>
      <name>ПриемНаРаботу</name>
      <description>Прием на работу</description>
    </items>
    <items>
      <name>ПроизводственныйКалендарь</name>
      <description>Производственный календарь</description>
    </items>
    <items>
      <name>РасчетЕСН</name>
      <description>Расчет ЕСН (до 2010 года)</description>
    </items>
    <items>
      <name>РасчетЗарплаты</name>
      <description>Расчет зарплаты</description>
    </items>
    <items>
      <name>РасчетСтраховыхВзносов</name>
      <description>Расчет страховых взносов (с 2010 года)</description>
    </items>
    <items>
      <name>РеклассиификацияБюджета</name>
      <description>Реклассиификация бюджета</description>
    </items>
    <items>
      <name>СведенияОСтавкахЕСНиПФР</name>
      <description>Сведения о ставках ЕСН и ПФР (до 2010 года)</description>
    </items>
    <items>
      <name>Договор</name>
      <description>Согласование договоров</description>
    </items>
    <items>
      <name>ЗакупочныйЗаказ</name>
      <description>Согласование закупочного заказа</description>
    </items>
    <items>
      <name>СогласованиеЗаявкиНаДобавлениеПрав</name>
      <description>Согласование заявки на добавление прав</description>
    </items>
    <items>
      <name>Контрагент</name>
      <description>Согласование контрагента</description>
    </items>
    <items>
      <name>СогласованиеНоменклатурныхГрупп</name>
      <description>Согласование номенклатурных групп</description>
    </items>
    <items>
      <name>Номенклатура</name>
      <description>Согласование номенклатуры</description>
    </items>
    <items>
      <name>СогласованиеОС</name>
      <description>Согласование ОС</description>
    </items>
    <items>
      <name>СогласованиеПрочихДоходовИРасходов</name>
      <description>Согласование прочих доходов и расходов</description>
    </items>
    <items>
      <name>СогласованиеРезервовПроизведенныхРасходов</name>
      <description>Согласование резервов произведенных расходов</description>
    </items>
    <items>
      <name>СогласованиеСтатейЗатрат</name>
      <description>Согласование статей затрат</description>
    </items>
    <items>
      <name>СчетНаОплату</name>
      <description>Согласование счета на оплату</description>
    </items>
    <items>
      <name>Увольнение</name>
      <description>Увольнение</description>
    </items>
  </predefined>
  <attributes>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Tasks/абсЗадачаДоговора/ObjectModule.bsl
//Перем мРолиПользователя Экспорт;

Процедура ПриВыполнении(Отказ)
	// {{ТТК Лапин А. Заявка № 04.08.2015 начало
	ДокОбъект = Ссылка.ПолучитьОбъект();
	Если НЕ ДокОбъект = Неопределено Тогда
		абс_БизнесПроцессыПривелегированный.ВыполнитьЗадачиПоТочкеМаршрута(БизнесПроцесс, ТочкаМаршрута, Ссылка);
	КонецЕсли;
	// }}ТТК Лапин А. Заявка № 04.08.2015 окончание
	// {{ТТК Лапин А. Старый код +
	//абс_БизнесПроцессыПривелегированный.ВыполнитьЗадачиПоТочкеМаршрута(БизнесПроцесс, ТочкаМаршрута, Ссылка);
	// }}ТТК Лапин А. Старый код -
КонецПроцедуры                              

Процедура ПередЗаписью(Отказ)
	
	// АБС ВСТАВКА Фролов 20120625
	// Запрещаем записывать задачи с незаполненным исполнителем
	////Если ЭтоНовый() И НЕ ЗначениеЗаполнено(Исполнитель) Тогда
	////	ttk_ОбщегоНазначения.СообщитьОбОшибке("Не указан ответственный при формировании задачи.", Отказ);
	////	Возврат;
	////КонецЕсли;
	
	
	// АБС ВСТАВКА Фролов 20110912 Чтобы не было блокировок таблицы Бизнес-процессов.
	// Добавил условие на ЭтоНовый() для того чтобы избежать этих действий при выполнении задач.
	Если ЭтоНовый() Тогда
		Если НЕ ИнициаторБП = БизнесПроцесс.ПользовательИнициаторБП Тогда
			ИнициаторБП = БизнесПроцесс.ПользовательИнициаторБП;
		КонецЕсли;
		
	    //АБС ВСТАВКА
		Если  ТипЗнч(ОбъектЗадачи) = Тип("ДокументСсылка.абс_ЗакупочныйЗаказ") Тогда
			ВидЗадачи = Справочники.ВидыЗадачПользователей.ЗакупочныйЗаказ;
			Организация = ОбъектЗадачи.Организация;
		ИначеЕсли  ТипЗнч(ОбъектЗадачи) = Тип("ДокументСсылка.абс_СчетНаОплату") Тогда
			ВидЗадачи = Справочники.ВидыЗадачПользователей.СчетНаОплату;
			//АБС ВСТАВКА №29763 НАЧАЛО «10 декабря 2014 г.», Пополитов
			//Иначе сотрудники КТТК не видят, из-за отбора по организации
			Если Не ЗначениеЗаполнено(Организация) Тогда
			//\\АБС ВСТАВКА №29763 КОНЕЦ
				Организация = ОбъектЗадачи.Организация;
			//АБС ВСТАВКА №29763 НАЧАЛО «10 декабря 2014 г.», Пополитов
			КонецЕсли;
			//\\АБС ВСТАВКА №29763 КОНЕЦ
		ИначеЕсли  ТипЗнч(ОбъектЗадачи) = Тип("СправочникСсылка.Контрагенты") Тогда
			ВидЗадачи = Справочники.ВидыЗадачПользователей.Контрагент;
		ИначеЕсли  ТипЗнч(ОбъектЗадачи) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			ВидЗадачи = Справочники.ВидыЗадачПользователей.Договор;
			//Сторчевой А.Н. 77125458 06.06.2017 {                                   
			Если не ЗначениеЗаполнено(Организация) Тогда 
			// } Сторчевой А.Н.	77125458 06.06.2017
				Организация = ОбъектЗадачи.Организация;
			//Сторчевой А.Н. 77125458 06.06.2017 {                                   
			КонецЕсли;
			// } Сторчевой А.Н.	77125458 06.06.2017
		ИначеЕсли  ТипЗнч(ОбъектЗадачи) = Тип("ДокументСсылка.ДоговорНаВыполнениеРаботСФизЛицом") Тогда
			ВидЗадачи = Справочники.ВидыЗадачПользователей.абс_ДоговорПодряда;
			Организация = ОбъектЗадачи.Организация;
		ИначеЕсли  ТипЗнч(ОбъектЗадачи) = Тип("ДокументСсылка.Абс_АктПриёмкиВыполненныхРабот") Тогда
			ВидЗадачи = Справочники.ВидыЗадачПользователей.абс_АктПриёмкиВыполненныхРабот;
			Организация = ОбъектЗадачи.Организация;
		ИначеЕсли  ТипЗнч(ОбъектЗадачи) = Тип("СправочникСсылка.Номенклатура") Тогда
			ВидЗадачи = Справочники.ВидыЗадачПользователей.Номенклатура;
		ИначеЕсли ТипЗнч(ОбъектЗадачи) = Тип("ДокументСсылка.абс_ЗадачаВТехподдержку") Тогда
			ВидЗадачи = Справочники.ВидыЗадачПользователей.абс_ЗаявкаВПоддержку;
			
			
		ИначеЕсли ТипЗнч(ОбъектЗадачи) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
			ВидЗадачи = Справочники.ВидыЗадачПользователей.СогласованиеСтатейЗатрат;	
		ИначеЕсли ТипЗнч(ОбъектЗадачи) = Тип("СправочникСсылка.ПрочиеДоходыИРасходы") Тогда
			ВидЗадачи = Справочники.ВидыЗадачПользователей.СогласованиеПрочихДоходовИРасходов; 	
		ИначеЕсли ТипЗнч(ОбъектЗадачи) = Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
			ВидЗадачи = Справочники.ВидыЗадачПользователей.СогласованиеНоменклатурныхГрупп;	
		ИначеЕсли ТипЗнч(ОбъектЗадачи) = Тип("СправочникСсылка.ОсновныеСредства") Тогда
			ВидЗадачи = Справочники.ВидыЗадачПользователей.СогласованиеОС;	
		ИначеЕсли ТипЗнч(ОбъектЗадачи) = Тип("ДокументСсылка.абс_ЗаявкаНаДобавлениеИзменениеПрав") Тогда
			ВидЗадачи = Справочники.ВидыЗадачПользователей.СогласованиеЗаявкиНаДобавлениеПрав;	
		ИначеЕсли ТипЗнч(ОбъектЗадачи) = Тип("ДокументСсылка.абс_РезервыПроизведенныхРасходов") Тогда
			ВидЗадачи = Справочники.ВидыЗадачПользователей.СогласованиеРезервовПроизведенныхРасходов;	
		ИначеЕсли ТипЗнч(ОбъектЗадачи) = Тип("ДокументСсылка.абс_ВводБюджета") Тогда
			ВидЗадачи = Справочники.ВидыЗадачПользователей.абс_ВводБюджета;	
		ИначеЕсли ТипЗнч(ОбъектЗадачи) = Тип("ДокументСсылка.абс_РеклассификацияБюджета") Тогда
			ВидЗадачи = Справочники.ВидыЗадачПользователей.РеклассиификацияБюджета;	
		КонецЕсли;	
		
		
		Если  ТипЗнч(БизнесПроцесс) = Тип("БизнесПроцессСсылка.абсЗакрытиеДоговоров") Тогда
			ВидЗадачи = Справочники.ВидыЗадачПользователей.Договор;	
		ИначеЕсли ТипЗнч(БизнесПроцесс) = Тип("БизнесПроцессСсылка.абсИзменениеРеквизитовКонтрагентов") Тогда
			ВидЗадачи = Справочники.ВидыЗадачПользователей.Контрагент;	
		ИначеЕсли ТипЗнч(БизнесПроцесс) = Тип("БизнесПроцессСсылка.абсПереутверждениеКонтрагентов") Тогда
			ВидЗадачи = Справочники.ВидыЗадачПользователей.Контрагент;	
		КонецЕсли;	
			
		
		//АБС_Родин
		Если Не ЗначениеЗаполнено(Организация) Тогда
			Организация	  = абс_БизнесПроцессыПривелегированный.ПолучитьОрганизациюБизнессПроцесса(БизнесПроцесс,Исполнитель);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Роль) Тогда
			Роль	     =  ТочкаМаршрута.Роль;
		КонецЕсли;
		//АБС_Родин
		
		////АБС 
		
		Если ЗначениеЗаполнено(ОбъектЗадачи) Тогда
			Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ОбъектЗадачи)) Тогда
				Комментарий = ОбъектЗадачи.Номер;
			ИначеЕсли Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(ОбъектЗадачи)) Тогда
				Комментарий = ОбъектЗадачи.Код;
			Иначе
				
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;

КонецПроцедуры

//мРолиПользователя = абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя(глЗначениеПеременной("глТекущийПользователь"));
